Repository: YoussefAboElmagd/SJC-attendance
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Attendance
ar: الحضور

source: Tasks
ar: التاسكات

source: Expense
ar: المصروفات

# Leave
source: Leaves
ar: الاجازات

# Leave_manager
source: Leaves management
ar: ادارة الاجازات

source: Don’t have an account ?
ar: ليس لديك حساب؟

# Login_button
source: Login
ar: تسجيل الدخول

# Login_text
source: Login
ar: تسجيل الدخول

source: Forgetten password ?
ar: هل نسيت كلمة المرور؟

# Email_form_field
source: Email
ar: البريد الإلكتروني

# email_mustnot_be_empty
source: email mustn't be empty
ar: يجب ألا يكون البريد الإلكتروني فارغًا

# password_mustnot_be_empty
source: password mustn't be empty
ar: يجب ألا تكون كلمة المرور فارغة

# mustnot_be_empty
source: mustn't be empty
ar: يجب ألا يكون فارغًا

# password_text
source: password
ar: كلمة المرور

# password_hint_text
source: enter your password
ar: أدخل كلمة المرور الخاصة بك

source: Sign up
ar: إنشاء حساب

source: Total Working Hour
ar: إجمالي ساعات العمل

source: Paid Period
ar: الفترة المدفوعة

source: Clock In
ar: تسجيل الحضور

source: Clock Out
ar: تسجيل الانصراف

source: Authentication Failed
ar: فشل التحقق

source: Biometric authentication failed. Please try again.
ar: فشل التحقق البيومتري. يرجى المحاولة مرة أخرى.

source: Locked Out
ar: تم القفل

source: Too many failed attempts. Try again later.
ar: عدد كبير من المحاولات الفاشلة. حاول مرة أخرى لاحقًا.

source: Let’s Clock-In!
ar: هيا لنسجل الدخول!

source: Don’t miss your clock in schedule
ar: لا تفوّت وقت تسجيل الدخول

source: Total Hours
ar: إجمالي الساعات

source: Clock in & Out
ar: تسجيل الدخول والخروج

source: No checkIn
ar: لا يوجد

source: No checkout
ar: لا يوجد

# No_work_entries_available
source: No Working Time Available
ar: لا توجد بيانات عمل متاحة

source: Today schedule
ar: جدول اليوم

source: view month work
ar: عرض عمل الشهر

source: No date
ar: لا يوجد تاريخ

source: Today
ar: اليوم

source: All Month work
ar: جميع أعمال الشهر

# Language_text
source: Language
ar: اللغة

# lang_arabic
source: Arabic
ar: العربية

# lang_en
source: English
ar: الإنجليزية

# sign_button
source: Sign In
ar: تسجيل الدخول

# sign_text
source: Sign In
ar: تسجيل الدخول

# sign_sub_text
source: Sign in to my account
ar: تسجيل الدخول إلى حسابي

source: Email
ar: البريد الإلكتروني

# Email_hint
source: My Email
ar: بريدي الإلكتروني

# email_validation
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

source: Password
ar: كلمة المرور

# password_hint
source: My Password
ar: كلمة المرور الخاصة بي

# password_validation
source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: Remember Me
ar: تذكرني

source: Forgot Password ?
ar: هل نسيت كلمة المرور؟

# change_language_button
source: language
ar: تغير اللغة

# on_borading_title
source: Navigate Your Work Journey Efficient & Easy
ar: تنقل في رحلتك المهنية بكفاءة وسهولة

# on_borading_sub_title
source: Increase your work management & career development radically
ar: قم بزيادة إدارة عملك وتطوير مسارك المهني بشكل جذري

# logout_button
source: Logout
ar: تسجيل الخروج

# no_continue_button
source: No
ar: لا العودة

# logout_and_login_again
source: Are you sure to logout ?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# Working_Period_text
source: Working Period
ar: فترة العمل

# working_time_text
source: Your working time in this paid period
ar: وقت عملك خلال هذه الفترة المدفوعة

# No_work_entries_available_text
source: No Working Time Available
ar: لا يوجد وقت عمل متاح

# have_any_working_text
source: It looks like you don’t have any working time in this period. Don’t worry, this space will be updated as new working time submitted.
ar: يبدو أنه ليس لديك أي وقت عمل خلال هذه الفترة. لا تقلق، سيتم تحديث هذه المساحة عند تقديم أوقات عمل جديدة.

# month_Working_Period_text
source: Month working Period
ar: فترة العمل الشهرية

# month_working_time_text
source: Your working time in this month
ar: وقت عملك في هذا الشهر

# have_any_month_working_text
source: It looks like you don’t have any working time in this month. Don’t worry, this space will be updated as new working time submitted.
ar: يبدو أنه ليس لديك أي وقت عمل مسجل هذا الشهر. لا تقلق، سيتم تحديث هذه المساحة عند تقديم وقت عمل جديد.

# Would_fingerprint
source: Would you like to authenticate with your fingerprint instead?
ar: هل ترغب في المصادقة باستخدام بصمة الإصبع؟

# Would_face
source: This device supports face recognition. Would you like to authenticate with your face?
ar: هذا الجهاز يدعم التعرف على الوجه. هل ترغب في المصادقة باستخدام وجهك؟

# Would_face_finger
source: Would you like to authenticate using your device biometrics?
ar: هل ترغب في المصادقة باستخدام البيانات البيومترية للجهاز؟

# Authenticate_button
source: Authenticate
ar: تأكيد

source: Cancel
ar: إلغاء

source: Authentication failed:
ar: فشلت المصادقة:

source: Authentication error:
ar: خطأ في المصادقة:

# Location_permissions_denied
source: Location permissions are denied please allow location to continue
ar: تم رفض أذونات الموقع، يرجى السماح بالموقع للمتابعة

# An_unexpected_error
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# Location_disabled
source: Location services are disabled
ar: تم تعطيل خدمات الموقع

# Location_permissions_denied_please
source: Location permissions are permanently denied please allow location to continue
ar: تم رفض أذونات الموقع بشكل دائم، يرجى السماح بالموقع للمتابعة

source: Expense Summary
ar: ملخص المصروفات

# Claim_expenses
source: Claim your expenses here.
ar: قدّم مصروفاتك هنا.

# Total_Expense_Text
source: Total Expense
ar: إجمالي المصروفات

source: Period text
ar: الفترة

# Total_text
source: Total
ar: الإجمالي

# Review_text
source: Review
ar: قيد المراجعة

# Approved_Text
source: Approved
ar: مقبول

# Review_Text
source: Review
ar: قيد المراجعة

# Rejected_text
source: Rejected
ar: مرفوض

source: Submit Expense
ar: إرسال المصروفات

# Type_text
source: Type
ar: النوع

# Ensure_All_Document
source: Ensure All Document Well Prepared
ar: تأكد من تجهيز جميع المستندات بشكل جيد

# Expenses_approved_text
source: 1000+ Expenses already approved
ar: أكثر من 1000 مصروف تمت الموافقة عليها بالفعل

source: Fill Claim Information
ar: املأ معلومات المطالبة

source: Information about claim details
ar: معلومات عن تفاصيل المطالبة

source: Upload Claim Document
ar: رفع مستندات المطالبة

# Format_should_be_in_pdf
source: Format should be in .pdf .jpeg .png less than 5MB
ar: يجب أن يكون التنسيق .pdf أو .jpeg أو .png وأقل من 5 ميغابايت

source: Expense Category
ar: فئة المصروف

source: Select Category
ar: اختر الفئة

source: Transaction Date
ar: تاريخ المعاملة

source: Enter Transaction Date
ar: أدخل تاريخ المعاملة

source: Expense Amount
ar: قيمة المصروف

source: Enter Amount
ar: أدخل المبلغ

source: Submit Date
ar: تاريخ الإرسال

source: Close Message
ar: إغلاق الرسالة

source: Expense Description
ar: وصف المصروف

source: Select Expense Category
ar: اختر فئة المصروف

source: Enter Expense Description
ar: أدخل وصف المصروف

source: Select file type
ar: اختر نوع الملف

# image_text
source: image
ar: صورة

source: Permission denied
ar: تم رفض الإذن

# error_occurred
source: some errors occurred
ar: حدثت بعض الأخطاء

# selected_text
source: Selected
ar: تم الاختيار

source: permission permanently denied
ar: تم رفض الإذن بشكل دائم

source: settings
ar: الإعدادات

# close_button
source: Close
ar: إغلاق

source: Leave Summary
ar: ملخص الإجازات

# Submit_Leave_text
source: Submit Leave
ar: تقديم إجازة

source: Total Leave
ar: إجمالي الإجازات

# Available_text
source: Available
ar: متاح

source: Leave Used
ar: الإجازات المستخدمة

source: No Leave Submitted!
ar: لم يتم تقديم أي إجازة!

# Ready_to_catch_some_fresh_air
source: Ready to catch some fresh air? Click “Submit Leave” and take that well-deserved break!
ar: هل أنت مستعد للحصول على بعض الهواء النقي؟ انقر على 'تقديم الإجازة' وخذ استراحتك المستحقة!

# Submit_Leave_button
source: Submit Now
ar: قدّم الآن

source: Fill Leave Information
ar: املأ معلومات الإجازة

# Information_leave_details
source: Information about leave details
ar: معلومات عن تفاصيل الإجازة

source: Leave Category
ar: فئة الإجازة

source: Leave Duration
ar: مدة الإجازة

source: Task Delegation
ar: تفويض المهام

# Emergency_Period
source: Emergency Contact During Leave Period
ar: جهة الاتصال في حالة الطوارئ خلال فترة الإجازة

source: Leave Description
ar: وصف الإجازة

source: Enter Leave Description
ar: أدخل وصف الإجازة

source: Select Leave category
ar: اختر فئة الإجازة

source: Leave Date
ar: تاريخ الإجازة

source: Select Duration
ar: اختر المدة

# home_text
source: Home
ar: الرئيسية

source: Challanges Awaiting
ar: تحديات في الانتظار

source: Let’s tackle your to do list
ar: لننجز قائمة المهام الخاصة بك

source: Summary of Your Work
ar: ملخص عملك

# current_task_progress
source: Your current task progress
ar: تقدم المهام الحالي

source: To Do
ar: للقيام

# Done_text
source: Done
ar: تم

# Sprint_Burnout_Stats
source: Sprint 20 - Burnout Stats
ar: Sprint 20 - إحصائيات الإرهاق

# completed_tasks_maintain
source: You've completed 8 more tasks than usual, maintain your task with your supervisor
ar: لقد أكملت 8 مهام أكثر من المعتاد، استمر في متابعة المهام مع المشرف الخاص بك

# All_text
source: All
ar: الكل

# In_Progress_text
source: In Progress
ar: قيد التنفيذ

# Finish_text
source: Finish
ar: منتهية

source: Wiring Dashboard Analytics
ar: تحليلات لوحة التحكم للأسلاك

# Create_Task_button
source: Create Task
ar: إنشاء مهمة

source: Create New Task
ar: إنشاء مهمة جديدة

# Attachment_text
source: Attachment
ar: مرفق

# Format_should_MB
source: Format should be in .pdf .jpeg .png less than 5MB
ar: يجب أن يكون التنسيق .pdf أو .jpeg أو .png وأقل من 5 ميغابايت

source: Task Title
ar: عنوان المهمة

source: Enter Task Title
ar: أدخل عنوان المهمة

source: Task Description
ar: وصف المهمة

source: Enter Task Description
ar: أدخل وصف المهمة

source: Assign To
ar: تعيين إلى

source: Select Member
ar: اختر عضو

source: Priority
ar: الأولوية

source: Select Priority
ar: اختر الأولوية

source: Tags
ar: الوسوم

source: Select tag
ar: اختر الوسم

source: Task_Details
ar: تفاصيل المهمة

source: amount
ar: المبلغ

# Department_text
source: Department
ar: القسم

source: Request type
ar: نوع الطلب

source: Select Department
ar: اختر القسم

source: Enter Department
ar: أدخل القسم

source: Select Request type
ar: اختر نوع الطلب

source: Enter Request type
ar: أدخل نوع الطلب

# new_section_text
source: New
ar: جديد

# Pending_section_text
source: Pending
ar: قيد الانتظار

# done_section_text
source: Done
ar: تم

source: Expenses Details
ar: تفاصيل المصروفات

# Expense_text
source: Expense
ar: مصروف

source: No Expense
ar: لا يوجد مصروفات

# It_looks_like_you_have_any_expense
source: It looks like you dont have any expense approved. Dont worry, this space will be updated as
ar: يبدو أنه ليس لديك أي مصروفات معتمدة بعد. لا تقلق، سيتم تحديث هذه المساحة عند إضافة

source: Successfully sent expenses
ar: تم ارسال المصروف بنجاح

source: there is no description
ar: لا يوجد وصف للمصروف

source: you should edit at least one
ar: يجب ان تقوم بتعديل واحد منهم علي الاقل

source: Expenses description
ar: وصف المصروف

# select_choice
source: Select
ar: تاكيد الاختيار

# reason_text
source: reason
ar: سبب الرفض

source: there is no amout
ar: لا يوجد مبلغ

source: Payroll and Tax
ar: الرواتب والضرائب

# Overtime_text
source: Overtime
ar: العمل الإضافي

source: Payroll Details
ar: تفاصيل الرواتب

source: Details about payroll
ar: تفاصيل حول الرواتب

source: Basic Salary
ar: الراتب الأساسي

source: Tax
ar: الضريبة

source: Reimbursement
ar: التعويض

source: Bonus
ar: المكافأة

source: Salary Slip
ar: قسيمة الراتب

source: Period
ar: الفترة

source: Net Salary
ar: صافي الراتب

source: Allowances
ar: البدلات

source: Deductions
ar: الخصومات

source: Overtime
ar: العمل الإضافي

source: Total Salary
ar: إجمالي الراتب

source: hrs
ar: ساعات

# token_expired
source: token seems to have expired or invalid
ar: يبدو أن رمز التحقق منتهي الصلاحية أو غير صالح

source: This Pay Period
ar: فترة الدفع الحالية

source: Close it
ar: اغلاق

source: Received
ar: تم الاستلام

source: Paid On
ar: تاريخ الدفع

source: Payroll
ar: الرواتب

# No_biometric
source: No biometric authentication available on this device
ar: لا يوجد وسيلة تحقق بيومترية متاحة على هذا الجهاز

# This_device_supports
source: This device supports face recognition. Would you like to authenticate with your face?
ar: هذا الجهاز يدعم التعرف على الوجه. هل ترغب في التحقق باستخدام وجهك؟

source: Use Face ID
ar: استخدام Face ID

source: Use Fingerprint
ar: استخدام البصمة

# Would_you_like
source: Would you like to authenticate with your fingerprint instead?
ar: هل ترغب في التحقق باستخدام بصمتك بدلاً من ذلك؟

source: Unknown error
ar: خطأ غير معروف

# Connection_failed
source: Connection to server failed due to internet connection
ar: فشل الاتصال بالخادم بسبب ضعف الاتصال بالإنترنت

# Request_cancelled
source: Request to the server was cancelled may be due to internet connection
ar: تم إلغاء الطلب إلى الخادم ربما بسبب الاتصال بالإنترنت

# Timeout
source: Connection timeout with the server may be due to internet connection
ar: انتهت مهلة الاتصال بالخادم ربما بسبب الاتصال بالإنترنت

# Receive_timeout
source: Receive timeout in connection with the server may be due to internet connection
ar: انتهت مهلة الاستلام من الخادم ربما بسبب الاتصال بالإنترنت

# Send_timeout
source: Send timeout in connection with the server may be due to internet connection
ar: انتهت مهلة الإرسال إلى الخادم ربما بسبب الاتصال بالإنترنت

# Something_wrong
source: Something went wrong
ar: حدث خطأ ما

source: try again
ar: حاول مجددا

# edit_button
source: Edit
ar: تعديل

# no_payroll_first
source: Your payroll during Year
ar: كشف الرواتب الخاص بك خلال السنة

# no_payroll_second
source: There is no Your payroll during Year
ar: لا يوجد كشف رواتب لك خلال السنة

# succesfully_send_Leave
source: succesfully send Leave request
ar: تم ارسال طلب الاجازه بنجاح

# Unknown_server_error
source: Unknown error occurred from server
ar: حدث خطأ غير معروف من الخادم

# non_accepted_period
source: The selected leave period conflicts with another leave. Please choose another period that does not conflict with any leave.
ar: فتره الاجازه التي تم اختيارها تتعارض مع اجازه اخري.برجاء اختيار فتره اخري لا تتعارض مع اي اجازه

source: Validate
ar: تحقق

source: Approve
ar: تاكيد

source: Refuse
ar: رفض
